# Projeto Técnicas de programação I

help('pandas.DataFrame.apply')

## Análise exploratória de dados/Pandas

Nomes:

Turma:

Nesse projeto trabalharemos com dados fictícios de investidores.

São 3 arquivos que devem ser carregados para responder as perguntas abaixo.

Para a entrega, coloque o notebook respondido no seu github (um por grupo)!

Informações

Cadastro:
- **id** : Identificação do investidor
- **Nome** : Nome completo do investidor 
- **Sexo** : Feminino ou masculino
- **Nasc** : Data de nascimento
- **Idade** : Idade do investidor 
- **Email** : E-mail do investidor
- **Lat_long** : Dados geográficos do investidor
- **Job** : Profisão do investidor ou do seu responsável (em inglês)
- **Estado** : Estado onde o investidor reside

Investimento:
- **id** : Identificação do investidor
- **Salario** : Renda do investidor ou seu responsável
- **Perfil** : Perfil de investimento
- **Ativo01, Ativo02, Ativo03, Ativo04, Ativo05, Ativo06, Ativo07** : O quanto de dinheiro o investidor colocou em cada ativo
- **Nota1, Nota2** : O quanto o investidor está satisfeito com nossa empresa (2 avaliações)

Lembrando que esses dados são irreais e fictícios

Arquivo cadastro.csv


Arquivo investimento.csv (dividido em 2 partes)

### Critérios de avaliação

Os seguintes itens serão avaliados:

1. Reprodutibilidade do código: seu código será executado e precisa gerar os mesmos resultados apresentados por você;

2. Clareza: seu código precisa ser claro e deve existir uma linha de raciocínio direta. Comente o código em pontos que julgar necessário para o entendimento total;

3. Explicação de todos os processos feitos e decisões tomadas

## Informações Gerais sobre o Projeto

- O projeto poderá ser desenvolvido __individualmente__ ou em __grupos com até 4 pessoas__, caos façam em grupos enviar a relação de alunos do grupo para o professor;


- Data de Entrega: 14/04/2023;

- Entrega: Através do _Class_

## 1 - Carregar os arquivos e cadastro, investimento1 e investimento2 e mostrar a quantidade de linhas de cada um, além das informações desses dataframes

In [1]:
# Pacotes gerados pelos alunos para testar os pacotes e carregar os arquivos: 

import Module
from Module import inv1, inv2, cadastro

# Pacotes recomendados pelo professor: 

import pandas as pd
import datetime as dt

Sucesso ao importar o pacote pandas.
Sucesso ao importar o pacote numpy.
Sucesso ao importar o pacote os.
Sucesso ao importar o pacote sys.
Sucesso ao importar o pacote matplotlib.pyplot.
Sucesso ao importar o pacote seaborn.
Sucesso ao importar o pacote statsmodels.
Sucesso ao importar o pacote scipy.
Sucesso ao importar o pacote pypfopt.
Sucesso ao importar o pacote functools.
Sucesso ao importar pandas as pd.
Sucesso ao importar numpy as np.
Sucesso ao importar os as os.
Sucesso ao importar sys as sys.
Sucesso ao importar matplotlib.pyplot as plt.
Sucesso ao importar seaborn as sns.
Sucesso ao importar statsmodels as sm.
Sucesso ao importar scipy.linalg as ln.
Sucesso ao importar pypfopt as pypfopt.
Sucesso ao importar functools as functools.

In [2]:
# Separador de texto: 

div = 50 * '-'

# Planilha de união de inv1 e inv2: 
merged = inv1.merge(inv2, on = list(inv1.columns), how = 'outer')


print(div,
      'Planilha: cadastro: ',
      f'len: {len(cadastro)}',
      f'Columns : {list(cadastro.columns)}',
      div,
      'Planilha: inv1: ',
      f'len: {len(inv1)}',
      f'Columns : {list(inv1.columns)}',
      div,
      'Planilha: inv2: ',
      f'len: {len(inv2)}',
      f'Columns : {list(inv2.columns)}',
      div,
      'Merged: ',
      f"len: {len(merged)}",
      f"Columns: {list(merged.columns)}",
      sep = '\n'
      )

--------------------------------------------------
Planilha: cadastro:
len: 38754
Columns : ['id', 'Nome', 'Sexo', 'Nasc', 'Idade', 'Email', 'Lat_long', 'Job', 'Estado']
--------------------------------------------------
Planilha: inv1:
len: 20000
Columns : ['id', 'Salario', 'Perfil', 'Ativo01', 'Ativo02', 'Ativo03', 'Ativo04', 'Ativo05', 'Ativo06', 'Ativo07', 'Nota1', 'Nota2']
--------------------------------------------------
Planilha: inv2:
len: 24052
Columns : ['id', 'Salario', 'Perfil', 'Ativo01', 'Ativo02', 'Ativo03', 'Ativo04', 'Ativo05', 'Ativo06', 'Ativo07', 'Nota1', 'Nota2']
--------------------------------------------------
Merged:
len: 38754
Columns: ['id', 'Salario', 'Perfil', 'Ativo01', 'Ativo02', 'Ativo03', 'Ativo04', 'Ativo05', 'Ativo06', 'Ativo07', 'Nota1', 'Nota2']

## 2 - Juntar os dataframes de investimento1 e investimento2 em um só e ver a quantidade de linhas

In [3]:
# Método para unir os dois dataframse: 

merged = pd.merge( # Funcao merge do dataframe. Neste caso, "how = 'outer'" é equivalente a usar pandas.concat() e .drop_duplicates()
    inv1, inv2, # dfs que serão unidos;
    on = list(inv1.columns), # Tabelas que serão consideradas para a união;
    how = 'outer') # Método de união. 'outer' significa que as linhas são unidas. Neste caso, há a concatenação e remoção dos duplicados.

# Para comparação:

# pd.concat(
#     [inv1, inv2]
# ).drop_duplicates()

## 3 - Crie um novo dataframe eliminando as linhas duplicadas

In [4]:
# O método merge how = 'outer' já elimina as linhas duplicadas. Para o caso de pd.concat, fica:

pd.concat(
    [inv1, inv2],
).drop_duplicates()

,id,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0011529,$2.25,Agressivo,1311.38,NaN,NaN,29267.48,4993.30,NaN,506.40,73.007216,30.025005
1,id0030644,$24.57,Agressivo,1007.38,4846.66,2717.82,12532.15,4282.98,NaN,499.93,20.000123,29.477728
2,id0019311,$367.53,Moderado,1128.99,4668.94,3092.60,9777.77,4246.30,2007.83,509.50,24.901450,49.659852
3,id0036705,$23.26,Moderado,1185.26,4782.17,2669.05,14047.87,6026.84,2064.09,489.82,14.246718,29.271206
4,id0001368,$6.31,Conservador,957.64,5585.52,NaN,5067.08,4030.51,2022.61,507.39,5.922253,11.840601
...,...,...,...,...,...,...,...,...,...,...,...,...
24046,id0012328,$86268.66,Moderado,804.92,4520.13,3388.55,18396.16,NaN,NaN,504.90,97.685833,70.195608
24048,id0005515,$212.76,Conservador,1624.80,NaN,2689.68,21886.01,4571.79,NaN,497.47,93.032164,93.621515
24049,id0009893,$9.32,Agressivo,829.20,NaN,3831.45,NaN,4784.34,2143.79,485.33,3.120521,9.086454
24050,id0016100,$81796.74,Conservador,1587.47,4881.66,4352.03,10391.18,4695.44,2465.65,492.84,95.665966,30.164927
24051,id0027880,$38480.37,Agressivo,996.90,5604.43,2801.04,9183.62,6220.96,NaN,503.24,55.035639,57.691996

## 4 - Junte o dataframe de investimento com o de cadastro
Dica: use a chave id

In [5]:
# Repete-se o método anterior, com as tabelas cadastro e merged.

total = cadastro.merge(merged, on = 'id')
total

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,Moderado,1174.27,4980.98,2638.24,NaN,4480.91,2329.72,480.72,79.600372,9.802620
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,Moderado,842.12,5646.09,3336.07,NaN,5624.22,2669.98,504.17,44.406893,90.512871
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,Agressivo,818.81,5516.52,3396.64,NaN,5033.83,2229.45,523.12,44.020024,65.060941
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,Agressivo,NaN,5258.69,3723.10,NaN,5933.91,NaN,486.05,25.597924,86.548918
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,Conservador,1505.16,6415.30,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
38749,id0038750,Beatriz Maísa de Miranda Milani,Fem,1999-02-20,22,mark47@gmail.com,"(Decimal('-23.8494875'), Decimal('-91.561304'))",Further education lecturer,RS,$4993.49,Moderado,1001.01,5561.55,NaN,8454.99,NaN,2191.78,489.76,66.644257,6.462871
38750,id0038751,Juan dos Santos,Masc,1999-07-10,22,greggnguyen@hotmail.com,"(Decimal('-7.8876355'), Decimal('155.835880'))",Adult guidance worker,PI,$41218.63,Moderado,1532.51,5102.84,3097.50,11243.08,4692.11,2368.93,496.02,96.987294,72.333030
38751,id0038752,Severino Edson de Viana Loase,Masc,1981-12-01,40,cindy11@yahoo.com,"(Decimal('-52.1338005'), Decimal('-59.715325'))",Arts development officer,PR,$32.41,Agressivo,1163.90,4911.63,3746.62,NaN,6733.79,2338.43,504.32,32.139610,22.742974
38752,id0038753,Kim Mooshi,Masc,1999-12-06,22,mcdonaldmario@gmail.com,"(Decimal('-81.2874995'), Decimal('-28.805800'))",Production manager,RJ,$914.52,Conservador,NaN,5532.35,2861.32,NaN,4921.77,2024.00,500.65,98.385080,56.611838
38753,id0038754,Vinícius Arnaldo de Pereira Mendes,Masc,2003-09-13,18,omartinez@hotmail.com,"(Decimal('-37.248521'), Decimal('6.033254'))",Pension scheme manager,AL,$29076.19,Moderado,981.62,4825.10,NaN,18085.88,5161.07,2257.66,507.95,29.660050,47.371606

## 5 - Ordene o dataframe pelo id, de forma crescente e redefina o índice

In [6]:
# O método sort_values organiza os dados por alguma ordem e coluna, a depender da escola do usuário.

# Ordenação do df:
total.sort_values(by = 'id', ascending = True)

# Redefinição do índice (.set_index('id')):

total = total.sort_values(by = 'id', ascending = True).set_index('id')
total

,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
id,,,,,,,,,,,,,,,,,,,
id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,Moderado,1174.27,4980.98,2638.24,NaN,4480.91,2329.72,480.72,79.600372,9.802620
id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,Moderado,842.12,5646.09,3336.07,NaN,5624.22,2669.98,504.17,44.406893,90.512871
id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,Agressivo,818.81,5516.52,3396.64,NaN,5033.83,2229.45,523.12,44.020024,65.060941
id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,Agressivo,NaN,5258.69,3723.10,NaN,5933.91,NaN,486.05,25.597924,86.548918
id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,Conservador,1505.16,6415.30,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
id0038750,Beatriz Maísa de Miranda Milani,Fem,1999-02-20,22,mark47@gmail.com,"(Decimal('-23.8494875'), Decimal('-91.561304'))",Further education lecturer,RS,$4993.49,Moderado,1001.01,5561.55,NaN,8454.99,NaN,2191.78,489.76,66.644257,6.462871
id0038751,Juan dos Santos,Masc,1999-07-10,22,greggnguyen@hotmail.com,"(Decimal('-7.8876355'), Decimal('155.835880'))",Adult guidance worker,PI,$41218.63,Moderado,1532.51,5102.84,3097.50,11243.08,4692.11,2368.93,496.02,96.987294,72.333030
id0038752,Severino Edson de Viana Loase,Masc,1981-12-01,40,cindy11@yahoo.com,"(Decimal('-52.1338005'), Decimal('-59.715325'))",Arts development officer,PR,$32.41,Agressivo,1163.90,4911.63,3746.62,NaN,6733.79,2338.43,504.32,32.139610,22.742974
id0038753,Kim Mooshi,Masc,1999-12-06,22,mcdonaldmario@gmail.com,"(Decimal('-81.2874995'), Decimal('-28.805800'))",Production manager,RJ,$914.52,Conservador,NaN,5532.35,2861.32,NaN,4921.77,2024.00,500.65,98.385080,56.611838
id0038754,Vinícius Arnaldo de Pereira Mendes,Masc,2003-09-13,18,omartinez@hotmail.com,"(Decimal('-37.248521'), Decimal('6.033254'))",Pension scheme manager,AL,$29076.19,Moderado,981.62,4825.10,NaN,18085.88,5161.07,2257.66,507.95,29.660050,47.371606

## 6 - Faça uma análise dos dados faltantes e trate-os

Mostre todas as colunas com dados faltantes, sua quantidade/porcentagem e como tratar (preencher) cada uma delas explicando sua estratégia

In [7]:
# Primeiro, descobrimos o tamanho da tabela:

size = len(total)

# Print: 

print(div, 
      'Total de faltas: ', 
      div, 
      sep = '\n')

# Print de cada coluna: 

for i in total:
      # Calculamos o total de ocorrências usando o método .dropna:
      occur = len(total[i]) - len(total[i].dropna())
      percent = str(100*occur/size)[:5] + ' %' # Caso queira exibir o número: percent = occur/size
      print(f'{i}: {occur}, % = {percent}')

--------------------------------------------------
Total de faltas:
--------------------------------------------------
Nome: 0, % = 0.0 %
Sexo: 0, % = 0.0 %
Nasc: 0, % = 0.0 %
Idade: 0, % = 0.0 %
Email: 0, % = 0.0 %
Lat_long: 0, % = 0.0 %
Job: 0, % = 0.0 %
Estado: 0, % = 0.0 %
Salario: 0, % = 0.0 %
Perfil: 0, % = 0.0 %
Ativo01: 9724, % = 25.09 %
Ativo02: 6100, % = 15.74 %
Ativo03: 6169, % = 15.91 %
Ativo04: 11887, % = 30.67 %
Ativo05: 6191, % = 15.97 %
Ativo06: 19514, % = 50.35 %
Ativo07: 0, % = 0.0 %
Nota1: 3000, % = 7.741 %
Nota2: 2000, % = 5.160 %

In [8]:
# O ativo 7 tem 100% de participação, logo todo investidor investiu em pelo menos um ativo. Investigamos agora se algum investidor não deu nota:

size = len(total[['Nota1', 'Nota2']]) # Separamos as colunas com notas
size_rem = len(total[['Nota1', 'Nota2']].dropna(how = 'all')) # Retiramos as colunas que não possuem nenhuma nota (método "how = 'all'")

occur = size - size_rem
percent = str((100*occur)/size)
# Total de investidores que não deu nenhuma nota: 

print(div,
      'Total de investidores que não deram nenhuma avaliação: ',
      div,
      sep = '\n')
print('Número:', occur)
print('%:', percent[:5] + '%')

--------------------------------------------------
Total de investidores que não deram nenhuma avaliação:
--------------------------------------------------
Número: 165
%: 0.425%

###  Considerações sobre dados faltantes:

In [9]:
# Separando os dados com faltas:

# Colunas com ativos
ativos_col = [
    'Ativo01',
    'Ativo02',
    'Ativo03',
    'Ativo04',
    'Ativo05',
    'Ativo06',
    'Ativo07'
]

# Colunas com notas
notas_col = ['Nota1', 'Nota2']

# dataframes:

df_ativos = total[ativos_col]
df_notas = total[notas_col]

### Ativos com nan:

Ativos totais

In [10]:
df_ativos

           Ativo01  Ativo02  Ativo03   Ativo04  Ativo05  Ativo06  Ativo07
id
id0000001  1174.27  4980.98  2638.24       NaN  4480.91  2329.72   480.72
id0000002   842.12  5646.09  3336.07       NaN  5624.22  2669.98   504.17
id0000003   818.81  5516.52  3396.64       NaN  5033.83  2229.45   523.12
id0000004      NaN  5258.69  3723.10       NaN  5933.91      NaN   486.05
id0000005  1505.16  6415.30  3462.67  30841.35  6044.86  2198.89   512.98
...            ...      ...      ...       ...      ...      ...      ...
id0038750  1001.01  5561.55      NaN   8454.99      NaN  2191.78   489.76
id0038751  1532.51  5102.84  3097.50  11243.08  4692.11  2368.93   496.02
id0038752  1163.90  4911.63  3746.62       NaN  6733.79  2338.43   504.32
id0038753      NaN  5532.35  2861.32       NaN  4921.77  2024.00   500.65
id0038754   981.62  4825.10      NaN  18085.88  5161.07  2257.66   507.95

[38754 rows x 7 columns]

Ativos separados

In [11]:
# Não existe 0 de investimento em nenhum ativo. Por esta razão, neste trabalho, NaN em investimentos significa $0 de investimento neste ativo.

df_ativos_nan = df_ativos[df_ativos.isna().any(axis = 1)]
df_ativos_nan.min() # Aqui mostramos o valor mínimo investido em cada ativo, levando-se em conta que o valor None não representa nenhum valor, por isto não é considerado.

Ativo01     800.01
Ativo02    4500.05
Ativo03    2500.01
Ativo04    5000.93
Ativo05    4000.14
Ativo06    2000.04
Ativo07     463.00
dtype: float64

In [12]:
# Aqui são todos os investidores que possuem NaN em algum ativo (neste rabalho, NaN significa 0).

df_ativos_nan

           Ativo01  Ativo02  Ativo03   Ativo04  Ativo05  Ativo06  Ativo07
id
id0000001  1174.27  4980.98  2638.24       NaN  4480.91  2329.72   480.72
id0000002   842.12  5646.09  3336.07       NaN  5624.22  2669.98   504.17
id0000003   818.81  5516.52  3396.64       NaN  5033.83  2229.45   523.12
id0000004      NaN  5258.69  3723.10       NaN  5933.91      NaN   486.05
id0000006   858.43  5628.75      NaN  13431.14  4409.81      NaN   492.03
...            ...      ...      ...       ...      ...      ...      ...
id0038749   988.55  4744.25      NaN  17341.08  4866.52  2049.56   498.69
id0038750  1001.01  5561.55      NaN   8454.99      NaN  2191.78   489.76
id0038752  1163.90  4911.63  3746.62       NaN  6733.79  2338.43   504.32
id0038753      NaN  5532.35  2861.32       NaN  4921.77  2024.00   500.65
id0038754   981.62  4825.10      NaN  18085.88  5161.07  2257.66   507.95

[32857 rows x 7 columns]

Notas com nan

In [13]:
df_notas_nan = df_notas[df_notas.isna().any(axis = 1)]
df_notas_nan

               Nota1      Nota2
id
id0000019        NaN  62.656956
id0000021        NaN  45.971684
id0000022        NaN  85.798564
id0000025        NaN  70.575475
id0000029        NaN   6.661650
...              ...        ...
id0038688        NaN   9.589640
id0038701        NaN  88.598436
id0038740        NaN  57.935261
id0038742  93.844274        NaN
id0038745  24.872004        NaN

[4835 rows x 2 columns]

In [14]:
# Aqui, verificamos que os valores None na coluna Notas não interferem na média dos valores.

df_notas_nan['mean_notas'] = df_notas_nan.mean(axis = 1) 
df_notas_nan

C:\Users\lucas\AppData\Local\Temp\ipykernel_15904\28906856.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_notas_nan['mean_notas'] = df_notas_nan.mean(axis = 1)

               Nota1      Nota2  mean_notas
id
id0000019        NaN  62.656956   62.656956
id0000021        NaN  45.971684   45.971684
id0000022        NaN  85.798564   85.798564
id0000025        NaN  70.575475   70.575475
id0000029        NaN   6.661650    6.661650
...              ...        ...         ...
id0038688        NaN   9.589640    9.589640
id0038701        NaN  88.598436   88.598436
id0038740        NaN  57.935261   57.935261
id0038742  93.844274        NaN   93.844274
id0038745  24.872004        NaN   24.872004

[4835 rows x 3 columns]

Notas com 2 nans

In [15]:
# Aqui vamos verificar as notas com dois valores Nan (investidores que não avaliaram o programa)

# Primeiro, pegamos os índices que possuem investidores que não avaliaram o programa para tratamento posterior.
ind = df_notas_nan[df_notas_nan[['Nota1', 'Nota2']].isna().all(axis=1)].index

# Aqui, criamos a coluna 'mean_notas', que possui a média das avaliações ou o valor '-1', para o caso de investidores que não avaliaram o programa.
df_notas_nan['mean_notas'].fillna(-1, inplace = True)

# Segue abaixo os valores '-1' para quem não fez nenhuma avaliação:
df_notas_nan.loc[ind]

C:\Users\lucas\AppData\Local\Temp\ipykernel_15904\2170344352.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_notas_nan['mean_notas'].fillna(-1, inplace = True)

           Nota1  Nota2  mean_notas
id
id0000060    NaN    NaN        -1.0
id0000124    NaN    NaN        -1.0
id0000268    NaN    NaN        -1.0
id0000273    NaN    NaN        -1.0
id0000639    NaN    NaN        -1.0
...          ...    ...         ...
id0037573    NaN    NaN        -1.0
id0037798    NaN    NaN        -1.0
id0037920    NaN    NaN        -1.0
id0038213    NaN    NaN        -1.0
id0038396    NaN    NaN        -1.0

[165 rows x 3 columns]

In [16]:
df = total[notas_col].mean(axis = 1)
df[df == 0]
df

id
id0000001    44.701496
id0000002    67.459882
id0000003    54.540483
id0000004    56.073421
id0000005    24.014800
               ...
id0038750    36.553564
id0038751    84.660162
id0038752    27.441292
id0038753    77.498459
id0038754    38.515828
Length: 38754, dtype: float64

### Fórmula de tratamento:

Ativos:

In [17]:
# Para o tratamento dos ativos, substituímos os valores faltantes por 0

total[ativos_col] = total[ativos_col].fillna(0)
total[ativos_col]

           Ativo01  Ativo02  Ativo03   Ativo04  Ativo05  Ativo06  Ativo07
id
id0000001  1174.27  4980.98  2638.24      0.00  4480.91  2329.72   480.72
id0000002   842.12  5646.09  3336.07      0.00  5624.22  2669.98   504.17
id0000003   818.81  5516.52  3396.64      0.00  5033.83  2229.45   523.12
id0000004     0.00  5258.69  3723.10      0.00  5933.91     0.00   486.05
id0000005  1505.16  6415.30  3462.67  30841.35  6044.86  2198.89   512.98
...            ...      ...      ...       ...      ...      ...      ...
id0038750  1001.01  5561.55     0.00   8454.99     0.00  2191.78   489.76
id0038751  1532.51  5102.84  3097.50  11243.08  4692.11  2368.93   496.02
id0038752  1163.90  4911.63  3746.62      0.00  6733.79  2338.43   504.32
id0038753     0.00  5532.35  2861.32      0.00  4921.77  2024.00   500.65
id0038754   981.62  4825.10     0.00  18085.88  5161.07  2257.66   507.95

[38754 rows x 7 columns]

Notas:

In [18]:
# Para o tratamento das notas, substítuímos as colunas 'Nota1' e 'Nota2' pela coluna 'mean_notas', que dá a média das avaliações de cada investidor, ou -1, 
# caso o investidor não tenha feito nenhuma avaliação.

# A nota tabela dos dados ficará conhecida por 'total_fixed'.

## Criamos uma cópia da tabela 'total', chamada de 'total_fixed':

total_fixed = total.copy()

## Criamos a coluna com as médias das notas, conforme apresentado anteriormente

total_fixed['Media'] = total_fixed[notas_col].mean(axis = 1) # Essa linha cria a coluna 'Média'
total_fixed.loc[:, 'Media'].fillna(-1, inplace = True) # Essa linha substitui NaN por -1
total_fixed.drop(notas_col, axis = 1, inplace = True) # Essa linha exclui as colunas de avaliações
total_fixed.head()

,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Media
id,,,,,,,,,,,,,,,,,,
id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,Moderado,1174.27,4980.98,2638.24,0.00,4480.91,2329.72,480.72,44.701496
id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,Moderado,842.12,5646.09,3336.07,0.00,5624.22,2669.98,504.17,67.459882
id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,Agressivo,818.81,5516.52,3396.64,0.00,5033.83,2229.45,523.12,54.540483
id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,Agressivo,0.00,5258.69,3723.10,0.00,5933.91,0.00,486.05,56.073421
id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,Conservador,1505.16,6415.30,3462.67,30841.35,6044.86,2198.89,512.98,24.014800

## 7 - Manipule os dados a seguir:
- Criar coluna "Total" somando o valor de todos os ativos por investidor
- Criar coluna "Media" com a média das notas 1 e 2
- Criar coluna "Dominio" com apenas o domínio do email (dica: separar por @)
- Mudar o nome da coluna "Salário" para "Renda" e tratar a coluna (sem caracter $ e tipo numérica)
- Mudar os dados da coluna "Sexo" para Masculino e Feminino (tente usar o map)
- Transformar os dados da coluna Media em inteiro
- Criar coluna "NPS" onde o investidor é promotor se a média das notas é maior igual a 80, neutro se a média estiver entre 50 e 80, e detrator se for abaixo de 50

In [19]:
#1 Para a resolução do problema, usamos:

## A seguinte serie é a soma do patrimônio investido:

total_fixed[ativos_col].sum(axis = 1)


## Cálculo do patrimônio:

df = pd.DataFrame() # Criamos um DataFrame vazio para salvar as informações da questão 7
df['Total'] = total_fixed[ativos_col].sum(axis = 1) # Salvamos os dados em df

###############################################################################################################################################
#2 Cálculo da média da nota (caso o investidor não tenha feito nenhuma avaliação a sua média será reconhecida como -1):

## Atualizamos o cálculo da média, utilizando o valor -1 para quem não deu nenhuma avaliação (Como o cálculo foi feito acidentalmente na questão anterior, apenas copiamos o resultado):

df = df.merge(total_fixed['Media'], left_index=True, right_index=True)

###############################################################################################################################################
#3 Domínio do e-mail: 

## Aqui, fazemos um split (estamos supondo que cada e-mail tem apenas um @. É possível afirmar isso graças ao output do código abaixo:):
# for i in total['Email']:
#     if len(i.split('@')) > 1:
#         print(i)

df['Dominio'] = total_fixed['Email'].apply(lambda x: x.split('@')[1])

###############################################################################################################################################
#4 Salário para renda e dado numérico:

## Primeiro, criamos a coluna: 
df['Renda'] = total_fixed['Salario'].copy()

## Agora, retiramos o símbolo $ (que sempre está na frente do valor) e transformamos em float:
df['Renda'] = df['Renda'].apply(lambda x: float(x[1:]))

###############################################################################################################################################
#5 Masc -> Masculino e Fem -> Feminino

# cadastro['Sexo'].drop_duplicates() # Verificar quantas opções existem
# 0     Fem
# 1    Masc

## Fazemos a cópia dos dados para df

df['Sexo'] = total_fixed['Sexo'].copy()

## Trocamos os valores de Fem para Feminino e de Masc para Masculino
df['Sexo'] = df['Sexo'].replace('Fem', 'Feminino').replace('Masc', 'Masculino')

###############################################################################################################################################

#6 Transformar a média em dado int

## Aplicamos a função que transforma o dado em int:

df['Media'] = df['Media'].apply(lambda x: int(x))

###############################################################################################################################################

#7 Média: 80+ -> Promotor, 50_80 -> Neutro, 50- -> Detrator.

## Usando compreensão de listas, criamos uma função que define uma string para x entre determinados dois valores numéricos:

y = {'D': [-1,49], 'N': [50, 80], 'P': [81, 100]}

df['NSP'] = df['Media'].apply(lambda x, y = y: str([nsp for nsp in y if y[nsp][0]<= x <= y[nsp][1]][0]))

df

              Total  Media      Dominio     Renda       Sexo NSP
id
id0000001  16084.84     44    yahoo.com     63.67   Feminino   D
id0000002  18622.65     67    yahoo.com     21.96  Masculino   N
id0000003  17518.37     54    yahoo.com  62497.64  Masculino   N
id0000004  15401.75     56  hotmail.com  99878.74   Feminino   N
id0000005  50981.21     24    yahoo.com    188.01   Feminino   D
...             ...    ...          ...       ...        ...  ..
id0038750  17699.09     36    gmail.com   4993.49   Feminino   D
id0038751  28532.99     84  hotmail.com  41218.63  Masculino   P
id0038752  19398.69     27    yahoo.com     32.41  Masculino   D
id0038753  15840.09     77    gmail.com    914.52  Masculino   N
id0038754  31819.28     38  hotmail.com  29076.19  Masculino   D

[38754 rows x 6 columns]

## 8 - Calcule os seguintes dados
- Calcule o total investido em cada coluna Ativo (tente usar o apply)
- Qual o menor valor investido em cada ativo?
- Mostre a média e desvio padrão de cada ativo
- Qual a idade do investidor mais velho?
- Qual a mediana da coluna Média?

In [20]:
# Total investido em cada ativo: 
## Primeiro selecionamos os dados, depois usamos a função apply para somar os elementos de cada coluna (Para linha, adicionamos axis = 1)

print(div,
      'Valor Total investido no ativo:',
      div,
      total_fixed[ativos_col].apply(lambda x: sum(x)),
      sep = '\n'
)

--------------------------------------------------
Valor Total investido no ativo:
--------------------------------------------------
Ativo01    3.275569e+07
Ativo02    1.680798e+08
Ativo03    1.023306e+08
Ativo04    4.071340e+08
Ativo05    1.720668e+08
Ativo06    4.462684e+07
Ativo07    1.937903e+07
dtype: float64

In [21]:
# Total investido em cada ativo: 
## Primeiro selecionamos os dados, depois usamos a função apply para encontrar o mínimo dos elementos de cada coluna (Para linha, adicionamos axis = 1)

print(div,
      'Valor mínimo investido no ativo:',
      div,
      total_fixed[ativos_col].apply(lambda x: min(x)),
      sep = '\n'
)

print(div,
      'Valor mínimo positivo investido no ativo:',
      div,
      total_fixed[ativos_col].apply(lambda x: min(x[x>0])),
      sep = '\n'
)

# NOTA: Caso queira verificar de forma manual, pode-se usar o seguinte código: 
# for i in ativos_col:
#     print(total_fixed[i].replace(0, 1_000_000).sort_values()[0])

--------------------------------------------------
Valor mínimo investido no ativo:
--------------------------------------------------
Ativo01      0.00
Ativo02      0.00
Ativo03      0.00
Ativo04      0.00
Ativo05      0.00
Ativo06      0.00
Ativo07    462.93
dtype: float64
--------------------------------------------------
Valor mínimo positivo investido no ativo:
--------------------------------------------------
Ativo01     800.01
Ativo02    4500.05
Ativo03    2500.01
Ativo04    5000.81
Ativo05    4000.14
Ativo06    2000.04
Ativo07     462.93
dtype: float64

In [22]:
# Média e desvio padrão:
## Primeiro pegamos os dados, depois mostramos o resultado do cálculo da mean e std:

mean_std = total_fixed[ativos_col].apply(lambda x: [x.mean(), x.std()])
mean_std.index = ['Média', 'Desvio-Padrão']
mean_std

,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07
Média,845.220878,4337.095701,2640.515840,10505.598580,4439.975773,1151.541631,500.052452
Desvio-Padrão,524.568525,1909.955896,1204.864694,9084.714705,2068.665605,1172.059182,9.998218

In [23]:
# Idade do investidor mais velho:
## Primeiro, separamos os dados:

pd.DataFrame(cadastro['Idade'])

## Depois, calculamos o máximo:
print(pd.DataFrame(cadastro['Idade']).apply(lambda x: max(x), axis = 0))

Idade    51
dtype: int64

In [24]:
# Mediana da coluna Média:
# df['Media'].median()
pd.DataFrame(df['Media']).apply(lambda x: x.median())

Media    49.0
dtype: float64

## 9 - Responder as perguntas abaixo

- Quantos investidores são promotores?
- Quantos investidores são do sexo feminino?
- Quantos investidores investiram mais de 16000 no Ativo04?
- Quantos investidores investiram mais de 16000 no Ativo04 e menos de 5000 no Ativo05?
- Quantos investidores do sexo feminino tem mais de 25 anos e investiu menos de 10000? (bonus: por que esse dado seria importante para a estratégia da nossa empresa?

- Quantos investidores tem em cada estado (dica: use groupby)
- Qual é a soma do total investido por cada estado?
- Como os investidores se distribuem em promotores, detratores e neutros?
- Qual é a média do total investido por promotores, detratores e neutros?

In [25]:
# Quantos são Promotores: 

print(div,
      'Total de Promotores: ',
      div, 
      len(df['NSP'][df['NSP'] == 'P']),
      sep = '\n'
)

--------------------------------------------------
Total de Promotores:
--------------------------------------------------
3368

In [26]:
# Quantos são femininos:

print(div,
      'Total de Femininos: ',
      div, 
      len(df[df['Sexo'] == 'Feminino']),
      sep = '\n'
)

--------------------------------------------------
Total de Femininos:
--------------------------------------------------
19385

In [27]:
# Ativo04 16000+ 

# Para facilitar a escrita, criamos uma nova Tabela:
tabela = pd.DataFrame(total_fixed['Ativo04'])

print(div,
      'Mais de R$ 16_000.00 investido em Ativo04: ',
      div, 
      len(tabela[tabela['Ativo04'] > 16000]),
      sep = '\n'
)

--------------------------------------------------
Mais de R$ 16_000.00 investido em Ativo04:
--------------------------------------------------
10689

In [28]:
# Ativo04 16000+ e Ativo 05 5000-

col = ['Ativo04', 'Ativo05']
tabela = total_fixed[col]

print(div,
      'Mais de R$ 16_000.00 investido em Ativo04 e menos de R$ 5_000.00 investido no Ativo05: ',
      div, 
      len(tabela[tabela['Ativo04'] > 16000][tabela['Ativo05'] < 5000]),
      sep = '\n'
)

--------------------------------------------------
Mais de R$ 16_000.00 investido em Ativo04 e menos de R$ 5_000.00 investido no Ativo05:
--------------------------------------------------
5374

C:\Users\lucas\AppData\Local\Temp\ipykernel_15904\3187086712.py:9: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  len(tabela[tabela['Ativo04'] > 16000][tabela['Ativo05'] < 5000]),

In [29]:
# Investidor feminino, idade 25+ e total 10000-

## Separamos os dados: 

col_1 = ['Idade'] # Dados da df 'total_fixed'
col_2 = ['Sexo', 'Total'] # Dados da df 'df'
tabela = total_fixed[col_1].merge(df[col_2], left_index = True, right_index = True)

print(div,
      'Investidor feminino, idade 25+ e total 10000-: ',
      div, 
      len(tabela[tabela['Sexo'] == 'Feminino'][tabela['Idade'] < 25][tabela['Total'] <10000]),
      sep = '\n'
)

--------------------------------------------------
Investidor feminino, idade 25+ e total 10000-:
--------------------------------------------------
407

C:\Users\lucas\AppData\Local\Temp\ipykernel_15904\1434817172.py:12: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  len(tabela[tabela['Sexo'] == 'Feminino'][tabela['Idade'] < 25][tabela['Total'] <10000]),

In [30]:
# Quantos investidores por estado:

print(div,
      'Quantos investidores por estado:',
      div, 
      total_fixed['Estado'].reset_index().groupby('Estado').count(), # Conta os ids não nulos
      sep = '\n'
)

--------------------------------------------------
Quantos investidores por estado:
--------------------------------------------------
          id
Estado
AC      1435
AL      1376
AM      1495
AP      1438
BA      1484
CE      1465
DF      1470
ES      1472
GO      1394
MA      1454
MG      1407
MS      1436
MT      1390
PA      1421
PB      1405
PE      1477
PI      1503
PR      1371
RJ      1466
RN      1472
RO      1440
RR      1495
RS      1393
SC      1430
SE      1319
SP      1464
TO      1382

In [31]:
# Total por estado:

print(div,
      'Total por estado:',
      div, 
      total_fixed[['Estado']].merge(df[['Total']], right_index = True, left_index = True).groupby('Estado').sum(),
      sep = '\n'
)

--------------------------------------------------
Total por estado:
--------------------------------------------------
              Total
Estado
AC      35362505.80
AL      33763479.45
AM      37036424.81
AP      34996432.12
BA      36188507.51
CE      35959807.36
DF      36277409.37
ES      36112618.12
GO      34234860.26
MA      34952752.65
MG      33820223.17
MS      35279491.41
MT      34206427.27
PA      34877463.97
PB      34248820.05
PE      35353945.12
PI      37038930.90
PR      33002424.19
RJ      35910946.83
RN      35755623.32
RO      34341430.55
RR      36543504.21
RS      34300026.29
SC      35223280.67
SE      32496697.65
SP      35624582.45
TO      33464097.56

In [32]:
# Distribuição de P, N e D:

print('Número de P: ', df[['Total', 'NSP']][df['NSP'] == 'P']['Total'].count())
print('Número de N: ', df[['Total', 'NSP']][df['NSP'] == 'N']['Total'].count())
print('Número de D: ', df[['Total', 'NSP']][df['NSP'] == 'D']['Total'].count())

Número de P:  3368
Número de N:  15772
Número de D:  19614

In [33]:
#
# Média de total:

print('Média de P: ', df[['Total', 'NSP']][df['NSP'] == 'P']['Total'].mean())
print('Média de N: ', df[['Total', 'NSP']][df['NSP'] == 'N']['Total'].mean())
print('Média de D: ', df[['Total', 'NSP']][df['NSP'] == 'D']['Total'].mean())

Média de P:  24238.099753562947
Média de N:  24496.518957012428
Média de D:  24389.70613337412